import telebot.types

def create_keyboard(*args: list[str]):
    board = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True)
    
    for row in args:
        board.add(*row)
    return board

algebra = create_keyboard(
    ["/главная"],
    ["Вычислительные навыки", "Найти значение выражения"],
    ["Работа с формулами", "Формулы сокращённого умножения"],
    ["Уравнения", "Неравенства"],
    ["Графики", "Тригонометрия"],
    ["Теория вероятности"]
)

cancel = create_keyboard(["Отмена"])

calculation = create_keyboard(
    ["/главная"],
    ["Действия с обычными дробями", "Действия с десятичными числами"]
)

expression = create_keyboard(
    ["/главная", "Степень и корень"],
    ["Действия со степенями", "Арифметический корень"]
)

graphics = create_keyboard(
    ["/главная", "Линейный"],
    ["Парабола", "Гипербола"]
)

AMF = create_keyboard(
    ["/главная", "Квадрат суммы"],
    ["Квадрат разности", "Разность квадратов"],
    ["Куб суммы", "Куб разности"],
    ["Сумма кубов", "Разность кубов"]
)

equation = create_keyboard(
    ["/главная", "Линейные уравнения"],
    ["Квадратные уравнения (дескриминант)", "Квадратные уравнения (Виет)"],
    ["Уравнения вида ax² + bx = 0", "Уравнения вида ax² + c = 0"]
)

inequality = create_keyboard(
    ["/главная"],
    ["Линейное неравенство", "Квадратное неравенство"]
)

trigonometry = create_keyboard(
    ["/главная"],
    ["Основные тригонометрические функции", "Тригонометрические уравнения"]
)

class Guest:
    main = create_keyboard(
        ["Зарегестрироваться как ученик"],
        ["Зарегестрироваться как учитель"],
        ["Алгебра", "Геометрия"]
    )

class Student:
    main = create_keyboard(
        ["Профиль", "Заявки"],
        ["Алгебра", "Геометрия"],
        ["Мои учителя", "Задания"]
    )
    
    task = create_keyboard(
        ["/главная"],
        ["Получить задания", "Отправить решение"]
    )
    
    profile = create_keyboard(
        ["/главная"],
        ["Удалить профиль", "Редактировать профиль"],
        ["Отмена"]
    )
    
    application = create_keyboard(
        ["/главная"],
        ["Принять заявку", "Отклонить заявку"]
    )

class Teacher:
    main = create_keyboard(
        ["Профиль"],
        ["Прикрепить класс", "Ваши учащиеся"],
        ["Задать задание", "Проверить задания"]
    )
    
    homework = create_keyboard(
        ["/главная"],
        ["Индивидуальное задание", "Задать задание классу"]
    )
    
    check_task = create_keyboard(
        ["/главная"],
        ["Индивидуальные задания", "Задания для класса"]
    )
    
    attached = create_keyboard(
        ["Прикрепить всех", "Отмена"]
    )
    
    action_on_solution = create_keyboard(
        ["Принять задание", "Отклонить задание"]
    )
    
    profile = Student.profile